{
  "posts": [
    {
      "id": 1,
      "title": "🌍 Beyond the Frame: How Bantu Stream Connect is Rewriting the Narrative for African Entertainment",
      "author": "Bantu Stream Team",
      "date": "2025-10-01",
      "thumbnail": "assets/blog/beyond-the-frame.jpg",
      "excerpt": "For too long, Africa’s creative industry has been boxed in by limited reach and foreign narratives. Bantu Stream Connect changes that — a new platform where African stories lead the global stage.",
      "content": [
        "Bantu Stream Connect was born from a simple idea: that Africa deserves its own digital powerhouse — a place where creators are empowered, not exploited.",
        "From films and podcasts to music and STEM education, the platform blends streaming, community, and creator tools in one place.",
        "The goal is to make growth and representation more important than profit. To create an ecosystem where African creators own their success, their audiences, and their futures."
      ]
    },
    {
      "id": 2,
      "title": "💰 Introducing the 90/10 Creator Revenue Model — A New Era for African Talent",
      "author": "Bantu Stream Connect",
      "date": "2025-10-03",
      "thumbnail": "assets/blog/9010-model.jpg",
      "excerpt": "Creators keep 90%, Bantu Stream keeps 10%. Simple, fair, and built for Africa.",
      "content": [
        "Unlike most streaming platforms that take 30–50% cuts, Bantu Stream Connect flips the system.",
        "With our 90/10 model, creators finally take home what they truly deserve. We focus on growth and empowerment, not corporate greed.",
        "This is not just a revenue model — it’s a statement of intent: that the future of African creativity is in the hands of its creators."
      ]
    },
    {
      "id": 3,
      "title": "🚀 The Founding Creator Program Is Here",
      "author": "Bantu Stream Connect",
      "date": "2025-10-05",
      "thumbnail": "assets/blog/founding-creators.jpg",
      "excerpt": "Early creators get premium placement, mentorship, and guaranteed revenue share on launch.",
      "content": [
        "The Founding Creator Program rewards those who believe early.",
        "Creators accepted into this program will receive front-page placement, promotional boosts, and personal growth support from our team.",
        "We’re not just building a platform — we’re building a movement for Africa’s storytellers."
      ]
    },
    {
      "id": 4,
      "title": "🎓 Introducing The Bantu Creator Empowerment Initiative",
      "author": "Bantu Stream Connect",
      "date": "2025-10-08",
      "thumbnail": "assets/blog/empowerment-initiative.jpg",
      "excerpt": "Bootcamps, mentorships, and workshops designed to elevate African creators to global excellence.",
      "content": [
        "Our Empowerment Initiative goes beyond streaming. It’s a holistic ecosystem to train, mentor, and equip creators across Africa.",
        "With bootcamps, live mentorship sessions, and funding access — we’re reshaping how Africa nurtures talent.",
        "Stay tuned as we announce the first cohort and exclusive opportunities to join."
      ]
    }
  ]
}
